app/controllers/api/parks_controller.rb

SELECT  "parks".* FROM "parks" WHERE "parks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def show
        @park = Park.find(params[:id])

SELECT  "parks".* FROM "parks" WHERE "parks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def trails_in_park
        temp_park = Park.find(params[:id])