app/controllers/api/reviews_controller.rb

INSERT INTO "reviews" ("post_date", "rating", "review", "user_id", "trail_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["post_date", "2021-05-19"], ["rating", 5], ["review", "Great hike!"], ["user_id", 1], ["trail_id", 1], ["created_at", "2021-05-18 17:54:07.999441"], ["updated_at", "2021-05-18 17:54:07.999441"]]
---
    def create
        # raise.params.inspect
        @review = Review.new(review_params)

        if @review.save!