app/controllers/api/trails_controller.rb

SELECT  "trails".* FROM "trails" WHERE "trails"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @trail = Trail.find(params[:id])

SELECT "trails".* FROM "trails"
---
    def index
        @trails = Trail.all

SELECT  "trails".* FROM "trails" WHERE "trails"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "trails"."park_id" FROM "trails" WHERE (park_id = 3) AND "trails"."id" != $1  [["id", 1]]
---
    def nearby_trails
        temp_trail = Trail.find(params[:id])

        @nearby_trails = Trail
                .select('*')
                .where('park_id = ?', temp_trail.park_id)
                .where.not(id: params[:id])